app/views/articles/partials/_mainArticles.html.erb

SELECT 1 AS one FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = $1 LIMIT $2  [["article_id", 1], ["LIMIT", 1]]
---
            <div class="categories_flex">
              <% if article.categories.any? %>