app/views/articles/_form.html.erb

        <%= f.label :Category, "Pick category/categories" %><br />
        <%= f.collection_check_boxes :category_ids, Category.all, :id, :name do |cb| %>
---
SELECT "categories".* FROM "categories"