app/views/users/show.html.erb

            <strong>
                <%= @user.articles.count %>
---
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 1]]

            <span>
                <%if @user.articles.count==0 %>
                    Blogs
                    <% elsif @user.articles.count==1%>
---
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 1]]

        <div class="user_blogs_box">
            <% if @user.articles.count < 1%>
---
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 1]]