app/controllers/articles_controller.rb

UPDATE "articles" SET "views" = COALESCE("views", 0) + $1 WHERE "articles"."id" = $2  [["views", 1], ["id", 1]]
---
  def show
    # Increment the view count
    @article.increment!(:views)

SELECT COUNT(*) FROM "articles"
---
  def index
    @articles = Article.order(views: :desc).paginate(page: params[:page], per_page: 10)

INSERT INTO "articles" ("title", "description", "content", "created_at", "updated_at", "user_id", "views") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @article = Article.new(permit_fields)
    @article.user = current_user
    if @article.save

UPDATE "articles" SET "updated_at" = $1 WHERE "articles"."id" = $2  [["updated_at", "2024-02-09 22:40:25.895418"], ["id", 1]]
---
  def update
    if @article.update(permit_fields)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_article
    @article = Article.find(params[:id])