app/controllers/pages_controller.rb

SELECT "articles".* FROM "articles" ORDER BY RANDOM() LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"
SELECT "articles".* FROM "articles" ORDER BY "articles"."views" DESC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT "categories".* FROM "categories"
---
  def home
    # Load random articles for the home page
    @articles = Article.order("RANDOM()").paginate(page: params[:page], per_page: 10)

    # Load trending articles based on views for the home page
    @trending_articles = Article.order(views: :desc).paginate(page: params[:page], per_page: 5)

    # Load the latest articles for the home page
    @latest_articles = Article.order(created_at: :desc).paginate(page: params[:page], per_page: 5)

    # Load all categories for the home page
    @categories = Category.all