app/controllers/users_controller.rb

    def show
      @articles = @user.articles.order(created_at: :desc).paginate(page: params[:page], per_page: 6)
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1 ORDER BY "articles"."created_at" DESC LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 6], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 1]]

    def index
      @users = User.paginate(page: params[:page], per_page: 15)
---
SELECT "users".* FROM "users" LIMIT $1 OFFSET $2  [["LIMIT", 15], ["OFFSET", 0]]

    def create
      @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("fullname", "username", "email", "created_at", "updated_at", "password_digest", "admin", "bio", "youtube_link", "instagram_link", "facebook_link", "twitter_link") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"